In [1]:
import pandas as pd
import numpy as np
#import seaborn as sns

In [497]:
train= pd.read_csv('train_data.csv')
test= pd.read_excel('test_data.xlsx')

c:\users\ankur.kumar\.conda\envs\tigerml\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Your version of xlrd is 1.2.0. In xlrd >= 2.0, only the xls format is supported. As a result, the openpyxl engine will be used if it is installed and the engine argument is not specified. Install openpyxl instead.

# Data Analysys

In [3]:
print(len(train),len(test))

79945 20055

In [4]:
train.head(1)

,order_item_id,order_date,delivery_date,item_id,item_size,item_color,brand_id,item_price,user_id,user_title,user_dob,user_state,user_reg_date,return
0,1,22-06-2016,27-06-2016,643,38,navy,30,49.9,30822,Mrs,17-04-1969,1013,23-06-2016,0

In [5]:
#checking the count of each target variable 
#result showing data is not imbalanced. almost equal number of data present for 0 and 1 target value.
train['return'].value_counts()

0    43283
1    36662
Name: return, dtype: int64

In [6]:
train.dtypes

order_item_id      int64
order_date        object
delivery_date     object
item_id            int64
item_size         object
item_color        object
brand_id           int64
item_price       float64
user_id            int64
user_title        object
user_dob          object
user_state         int64
user_reg_date     object
return             int64
dtype: object

In [7]:
#checking % missing from each column
#two columns has null values
#we are going to use user_reg_date but not the user_dob.
#dropping user id as well. we are not going to use as it will not add more value to data
print(train.isnull().sum())

order_item_id       0
order_date          0
delivery_date    7436
item_id             0
item_size           0
item_color          0
brand_id            0
item_price          0
user_id             0
user_title          0
user_dob         6989
user_state          0
user_reg_date       0
return              0
dtype: int64

In [8]:
#we are going to use user_reg_date but not the user_dob.
#dropping user id as well. we are not going to use as it will not add more value to data
train_new=train.drop(['user_dob','user_id'], axis=1)

In [10]:
print(train_new.isnull().sum())

order_item_id       0
order_date          0
delivery_date    7436
item_id             0
item_size           0
item_color          0
brand_id            0
item_price          0
user_title          0
user_state          0
user_reg_date       0
return              0
dtype: int64

In [11]:
train_nul= train_new[(train_new['delivery_date'].isnull()) ]
train_not_nul= train_new[(train_new['delivery_date'].notnull()) ]

In [12]:
print(len(train_nul),len(train_not_nul))

7436 72509

In [15]:
#checking the frequency of each target variable where delivery_date is null
#outcome : all such rows belongs to 0 class. not going to add much value. going to drop those rows. So going to proceed with 'train_not_nul'
train_nul['return'].value_counts()

0    7436
Name: return, dtype: int64

In [16]:
train_not_nul.isnull().sum()

order_item_id    0
order_date       0
delivery_date    0
item_id          0
item_size        0
item_color       0
brand_id         0
item_price       0
user_title       0
user_state       0
user_reg_date    0
return           0
dtype: int64

In [18]:
train_not_nul.head(2)

,order_item_id,order_date,delivery_date,item_id,item_size,item_color,brand_id,item_price,user_title,user_state,user_reg_date,return
0,1,22-06-2016,27-06-2016,643,38,navy,30,49.9,Mrs,1013,23-06-2016,0
1,10,22-06-2016,27-06-2016,195,xxl,grey,46,19.9,Mrs,1001,15-03-2015,1

In [115]:
#Dropping more unnecessary columns
df_tr=train_not_nul.drop(['order_item_id','item_id'], axis=1)

In [116]:
df_tr.head()

,order_date,delivery_date,item_size,item_color,brand_id,item_price,user_title,user_state,user_reg_date,return
0,22-06-2016,27-06-2016,38,navy,30,49.9,Mrs,1013,23-06-2016,0
1,22-06-2016,27-06-2016,xxl,grey,46,19.9,Mrs,1001,15-03-2015,1
2,22-06-2016,05-07-2016,xxl,grey,5,79.9,Mrs,1001,15-03-2015,0
3,23-06-2016,26-06-2016,m,brown,20,19.9,Mrs,1013,17-02-2015,0
4,23-06-2016,26-06-2016,40,black,44,90.0,Mrs,1006,09-02-2016,1

In [117]:
#varyying a lot depending upon the product type and age of the customer
#Outcome: going to drop it as well
df_tr['item_size'].unique()

array(['38', 'xxl', 'm', '40', '42', 'l', 'xl', '41', '7', '18', '44',
       '19', 'unsized', '36', '6', '6+', '4', '39', '45', '37', '48',
       '7+', 's', '8', '9+', '50', '5+', '9', '46', '35', '21', '10',
       '43', '11+', '24', '20', '128', '11', '38+', '5', '12', '140',
       '8+', '41+', '116', '4+', '40+', '26', '47', '52', '31', '32',
       '28', '27', '39+', '22', '152', '30', '10+', '1', '104', '33',
       'xs', '37+', '46+', '34', '29', '13', '42+', '23', '3632', '25',
       '3+', '54', '36+', '44+', '3832', '3332', '4032', '3432', 'xxxl',
       '43+', '100', '2', '176', '3', '164', '56', '45+', '90', '58',
       '4034', '3834', '80', '2+', '3132', '14', '12+', '84', '3634'],
      dtype=object)

In [118]:
df_tr=df_tr.drop(['item_size'], axis=1)

In [119]:
df_tr.head()

,order_date,delivery_date,item_color,brand_id,item_price,user_title,user_state,user_reg_date,return
0,22-06-2016,27-06-2016,navy,30,49.9,Mrs,1013,23-06-2016,0
1,22-06-2016,27-06-2016,grey,46,19.9,Mrs,1001,15-03-2015,1
2,22-06-2016,05-07-2016,grey,5,79.9,Mrs,1001,15-03-2015,0
3,23-06-2016,26-06-2016,brown,20,19.9,Mrs,1013,17-02-2015,0
4,23-06-2016,26-06-2016,black,44,90.0,Mrs,1006,09-02-2016,1

In [120]:
def date_change(dt):
    from datetime import datetime
    date_format = "%d-%m-%Y"
    a = datetime.strptime(dt, date_format)
    return a

In [121]:
df_tr['order_date_useful']=df_tr['order_date'].apply(date_change)
df_tr['delivery_date_useful']=df_tr['delivery_date'].apply(date_change)
df_tr['user_reg_date_useful']=df_tr['user_reg_date'].apply(date_change)

In [122]:
df_tr.head()

,order_date,delivery_date,item_color,brand_id,item_price,user_title,user_state,user_reg_date,return,order_date_useful,delivery_date_useful,user_reg_date_useful
0,22-06-2016,27-06-2016,navy,30,49.9,Mrs,1013,23-06-2016,0,2016-06-22,2016-06-27,2016-06-23
1,22-06-2016,27-06-2016,grey,46,19.9,Mrs,1001,15-03-2015,1,2016-06-22,2016-06-27,2015-03-15
2,22-06-2016,05-07-2016,grey,5,79.9,Mrs,1001,15-03-2015,0,2016-06-22,2016-07-05,2015-03-15
3,23-06-2016,26-06-2016,brown,20,19.9,Mrs,1013,17-02-2015,0,2016-06-23,2016-06-26,2015-02-17
4,23-06-2016,26-06-2016,black,44,90.0,Mrs,1006,09-02-2016,1,2016-06-23,2016-06-26,2016-02-09

In [123]:
df_tr['delivery_time']= df_tr['delivery_date_useful']- df_tr['order_date_useful']
df_tr['cust_att_time']= df_tr['order_date_useful']- df_tr['user_reg_date_useful']

In [124]:
df_tr.head()

,order_date,delivery_date,item_color,brand_id,item_price,user_title,user_state,user_reg_date,return,order_date_useful,delivery_date_useful,user_reg_date_useful,delivery_time,cust_att_time
0,22-06-2016,27-06-2016,navy,30,49.9,Mrs,1013,23-06-2016,0,2016-06-22,2016-06-27,2016-06-23,5 days,-1 days
1,22-06-2016,27-06-2016,grey,46,19.9,Mrs,1001,15-03-2015,1,2016-06-22,2016-06-27,2015-03-15,5 days,465 days
2,22-06-2016,05-07-2016,grey,5,79.9,Mrs,1001,15-03-2015,0,2016-06-22,2016-07-05,2015-03-15,13 days,465 days
3,23-06-2016,26-06-2016,brown,20,19.9,Mrs,1013,17-02-2015,0,2016-06-23,2016-06-26,2015-02-17,3 days,492 days
4,23-06-2016,26-06-2016,black,44,90.0,Mrs,1006,09-02-2016,1,2016-06-23,2016-06-26,2016-02-09,3 days,135 days

In [125]:
def day_to_int(a):
    b=str(a)
    c=b[0:2]
    d=int(c)
    return d

In [126]:
df_tr['delivery_time']=df_tr['delivery_time'].apply(day_to_int)
df_tr['cust_att_time']=df_tr['cust_att_time'].apply(day_to_int)

In [127]:
df_tr.head()

,order_date,delivery_date,item_color,brand_id,item_price,user_title,user_state,user_reg_date,return,order_date_useful,delivery_date_useful,user_reg_date_useful,delivery_time,cust_att_time
0,22-06-2016,27-06-2016,navy,30,49.9,Mrs,1013,23-06-2016,0,2016-06-22,2016-06-27,2016-06-23,5,-1
1,22-06-2016,27-06-2016,grey,46,19.9,Mrs,1001,15-03-2015,1,2016-06-22,2016-06-27,2015-03-15,5,46
2,22-06-2016,05-07-2016,grey,5,79.9,Mrs,1001,15-03-2015,0,2016-06-22,2016-07-05,2015-03-15,13,46
3,23-06-2016,26-06-2016,brown,20,19.9,Mrs,1013,17-02-2015,0,2016-06-23,2016-06-26,2015-02-17,3,49
4,23-06-2016,26-06-2016,black,44,90.0,Mrs,1006,09-02-2016,1,2016-06-23,2016-06-26,2016-02-09,3,13

In [130]:
len(df_tr[df_tr['cust_att_time']<0])

14430

In [131]:
#14430 rows of data here are having registartion date less than order date. This means data is not correct. So going to drop such rows
df_train=df_tr[df_tr['cust_att_time']>-1]

In [132]:
len(df_train)

58079

In [133]:
df_train.head()

,order_date,delivery_date,item_color,brand_id,item_price,user_title,user_state,user_reg_date,return,order_date_useful,delivery_date_useful,user_reg_date_useful,delivery_time,cust_att_time
1,22-06-2016,27-06-2016,grey,46,19.9,Mrs,1001,15-03-2015,1,2016-06-22,2016-06-27,2015-03-15,5,46
2,22-06-2016,05-07-2016,grey,5,79.9,Mrs,1001,15-03-2015,0,2016-06-22,2016-07-05,2015-03-15,13,46
3,23-06-2016,26-06-2016,brown,20,19.9,Mrs,1013,17-02-2015,0,2016-06-23,2016-06-26,2015-02-17,3,49
4,23-06-2016,26-06-2016,black,44,90.0,Mrs,1006,09-02-2016,1,2016-06-23,2016-06-26,2016-02-09,3,13
5,23-06-2016,26-06-2016,bordeaux,72,59.9,Mrs,1008,21-01-2016,1,2016-06-23,2016-06-26,2016-01-21,3,15

In [135]:
#dropping extra columns
df_train=df_train.drop(['order_date','delivery_date','user_reg_date','order_date_useful','delivery_date_useful','user_reg_date_useful'], axis=1)

In [136]:
df_train.head()

,item_color,brand_id,item_price,user_title,user_state,return,delivery_time,cust_att_time
1,grey,46,19.9,Mrs,1001,1,5,46
2,grey,5,79.9,Mrs,1001,0,13,46
3,brown,20,19.9,Mrs,1013,0,3,49
4,black,44,90.0,Mrs,1006,1,3,13
5,bordeaux,72,59.9,Mrs,1008,1,3,15

In [140]:
df_train.dtypes

item_color        object
brand_id           int64
item_price       float64
user_title        object
user_state         int64
return             int64
delivery_time      int64
cust_att_time      int64
dtype: object

In [142]:
print(df_train['item_color'].nunique())
print(df_train['brand_id'].nunique())
print(df_train['user_state'].nunique())

77
132
16

In [137]:
from sklearn.preprocessing import LabelEncoder
from sklearn.pipeline import Pipeline

In [138]:
class MultiColumnLabelEncoder:
    def __init__(self,columns = None):
        self.columns = columns # array of column names to encode

    def fit(self,X,y=None):
        return self # not relevant here

    def transform(self,X):
        '''
        Transforms columns of X specified in self.columns using
        LabelEncoder(). If no columns specified, transforms all
        columns in X.
        '''
        output = X.copy()
        if self.columns is not None:
            for col in self.columns:
                output[col] = LabelEncoder().fit_transform(output[col])
        else:
            for colname,col in output.iteritems():
                output[colname] = LabelEncoder().fit_transform(col)
        return output

    def fit_transform(self,X,y=None):
        return self.fit(X,y).transform(X)

In [146]:
df_train=MultiColumnLabelEncoder(columns = ['item_color','brand_id','user_title','user_state']).fit_transform(df_train)

In [148]:
df_train.corr()
#item_color and item_price are somewhat correlated - (-0.163559) . item_price is more correlated with return - (|0.152310|>|-0.017578|)

,item_color,brand_id,item_price,user_title,user_state,return,delivery_time,cust_att_time
item_color,1.000000,-0.041106,-0.163559,0.001838,0.001916,-0.017578,-0.004945,0.000959
brand_id,-0.041106,1.000000,0.085224,-0.003910,-0.002048,0.023968,0.020883,-0.002702
item_price,-0.163559,0.085224,1.000000,-0.021008,-0.006233,0.152310,0.130618,0.005201
user_title,0.001838,-0.003910,-0.021008,1.000000,-0.009235,-0.000131,0.005885,0.034550
user_state,0.001916,-0.002048,-0.006233,-0.009235,1.000000,-0.005667,-0.000789,0.011826
return,-0.017578,0.023968,0.152310,-0.000131,-0.005667,1.000000,-0.012543,0.016361
delivery_time,-0.004945,0.020883,0.130618,0.005885,-0.000789,-0.012543,1.000000,-0.012736
cust_att_time,0.000959,-0.002702,0.005201,0.034550,0.011826,0.016361,-0.012736,1.000000

In [149]:
df_train.head()

,item_color,brand_id,item_price,user_title,user_state,return,delivery_time,cust_att_time
1,47,45,19.9,3,0,1,5,46
2,47,4,79.9,3,0,0,13,46
3,22,19,19.9,3,12,0,3,49
4,18,43,90.0,3,5,1,3,13
5,21,71,59.9,3,7,1,3,15

In [ ]:
#pd.get_dummies(df_train,drop_first=True)

In [152]:
df_train=df_train[['item_color','brand_id','item_price','user_title','user_state','delivery_time','cust_att_time','return']]

In [153]:
df_train.head()

,item_color,brand_id,item_price,user_title,user_state,delivery_time,cust_att_time,return
1,47,45,19.9,3,0,5,46,1
2,47,4,79.9,3,0,13,46,0
3,22,19,19.9,3,12,3,49,0
4,18,43,90.0,3,5,3,13,1
5,21,71,59.9,3,7,3,15,1

In [160]:
x=df_train.iloc[:,0:7]
y=df_train.iloc[:,-1:]

In [163]:
x.head()

,item_color,brand_id,item_price,user_title,user_state,delivery_time,cust_att_time
1,47,45,19.9,3,0,5,46
2,47,4,79.9,3,0,13,46
3,22,19,19.9,3,12,3,49
4,18,43,90.0,3,5,3,13
5,21,71,59.9,3,7,3,15

In [164]:
y.head()

   return
1       1
2       0
3       0
4       1
5       1

In [205]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.25, random_state = 42)

In [206]:
len(x_train),len(x_test)

(43559, 14520)

In [207]:
#almost same
y_train['return'].value_counts()

1    22112
0    21447
Name: return, dtype: int64

# Feature Transformation

In [174]:
#Standardization
from sklearn.preprocessing import StandardScaler
scaler= StandardScaler()

In [176]:
#MIN-MAX scalar
from sklearn.preprocessing import MinMaxScaler
scaler_1=MinMaxScaler()

In [208]:
#Robustscaler
from sklearn.preprocessing import RobustScaler
scaler_2= RobustScaler()
df_rs_x_train = pd.DataFrame(scaler_2.fit_transform(x_train))
df_rs_x_test = pd.DataFrame(scaler_2.transform(x_test))

In [209]:
df_rs_x_train.head()

          0         1    2    3      4         5         6
0 -0.363636 -0.230769  1.4  0.0  0.250 -0.666667 -0.103448
1  0.840909 -0.153846 -0.2  0.0 -0.125 -0.333333  0.413793
2 -0.340909  0.282051  0.0  0.0 -0.625  1.666667  0.103448
3  0.295455 -0.641026  0.0  0.0  0.375  0.333333 -1.310345
4 -0.568182  0.589744 -0.2  0.0 -0.125 -0.666667  0.620690

In [210]:
df_rs_x_test.head()

          0         1      2    3      4         5         6
0 -0.363636 -0.564103 -0.099  0.0 -0.750 -0.666667  0.000000
1 -0.363636 -0.358974  0.000 -2.0 -0.875 -3.333333 -1.310345
2  0.568182  0.179487  0.200  0.0 -0.750  2.666667  0.793103
3  0.727273 -0.384615  0.400  0.0 -0.750  0.000000 -0.793103
4  0.295455  1.871795 -0.500  0.0 -0.750 -0.333333  0.137931

# Modeling

In [211]:
df_rs_x_train_1=df_rs_x_train.iloc[:,0:7].values
df_rs_x_test_1= df_rs_x_test.iloc[:,0:7].values

In [212]:
df_rs_x_test_1

array([[-0.36363636, -0.56410256, -0.099     , ..., -0.75      ,
        -0.66666667,  0.        ],
       [-0.36363636, -0.35897436,  0.        , ..., -0.875     ,
        -3.33333333, -1.31034483],
       [ 0.56818182,  0.17948718,  0.2       , ..., -0.75      ,
         2.66666667,  0.79310345],
       ...,
       [-0.27272727, -0.38461538, -0.1       , ..., -0.75      ,
         0.33333333,  0.13793103],
       [ 0.77272727,  0.30769231,  2.2       , ..., -0.75      ,
        -0.66666667,  0.24137931],
       [-0.27272727, -0.38461538, -0.1       , ...,  0.25      ,
        -0.66666667,  0.17241379]])

In [215]:
y_train_1=y_train.iloc[:,0:1].values
y_test_1=y_test.iloc[:,0:1].values

In [218]:
print(len(df_rs_x_train_1), len(y_train_1))
print(len(df_rs_x_test_1),len(y_test_1))

43559 43559
14520 14520

In [219]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression()

In [230]:
from sklearn.svm import SVC
classifier = SVC(kernel = 'linear', random_state = 0)

In [238]:
from sklearn.tree import DecisionTreeClassifier
classifier = DecisionTreeClassifier(criterion = 'entropy', random_state = 0)

In [446]:
from sklearn.ensemble import RandomForestClassifier
classifier = RandomForestClassifier(n_estimators = 80, criterion = 'entropy', random_state = 0)

In [278]:
from sklearn.naive_bayes import GaussianNB
classifier = GaussianNB()

In [502]:
#this model we have used for our prediction
from sklearn.ensemble import GradientBoostingClassifier
classifier = GradientBoostingClassifier(n_estimators=80, learning_rate=0.81,max_depth=1, random_state=42)

In [503]:
len(df_rs_x_train_1),len(y_train_1)

(43559, 43559)

In [504]:
classifier.fit(df_rs_x_train_1, y_train_1)

C:\Users\ankur.kumar\AppData\Roaming\Python\Python37\site-packages\sklearn\ensemble\_gb.py:1454: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

GradientBoostingClassifier(ccp_alpha=0.0, criterion='friedman_mse', init=None,
                           learning_rate=0.81, loss='deviance', max_depth=1,
                           max_features=None, max_leaf_nodes=None,
                           min_impurity_decrease=0.0, min_impurity_split=None,
                           min_samples_leaf=1, min_samples_split=2,
                           min_weight_fraction_leaf=0.0, n_estimators=80,
                           n_iter_no_change=None, presort='deprecated',
                           random_state=42, subsample=1.0, tol=0.0001,
                           validation_fraction=0.1, verbose=0,
                           warm_start=False)

In [449]:
y_pred = classifier.predict(df_rs_x_test_1)

In [450]:
y_pred

array([0, 1, 1, ..., 1, 1, 1], dtype=int64)

In [451]:
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score,recall_score,precision_score,f1_score
cm = confusion_matrix(y_test_1, y_pred)
acc=accuracy_score(y_test_1, y_pred)

In [452]:
cm

array([[4051, 3098],
       [2868, 4503]], dtype=int64)

In [453]:
acc

0.5891184573002755

In [455]:
# Applying k-Fold Cross Validation
from sklearn.model_selection import cross_val_score
accuracies = cross_val_score(estimator = classifier, X = df_rs_x_train_1, y = y_train_1, cv = 10)
print('mean acc:',accuracies.mean())
print('std dev:',accuracies.std())

C:\Users\ankur.kumar\AppData\Roaming\Python\Python37\site-packages\sklearn\model_selection\_validation.py:515: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\ankur.kumar\AppData\Roaming\Python\Python37\site-packages\sklearn\model_selection\_validation.py:515: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\ankur.kumar\AppData\Roaming\Python\Python37\site-packages\sklearn\model_selection\_validation.py:515: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\ankur.kumar\AppData\Roaming\Python\Python37\site-packages\sklearn\model_selection\_validation.py:515: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\ankur.kumar\AppData\Roaming\Python\Python37\site-packages\sklearn\model_selection\_validation.py:515: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\ankur.kumar\AppData\Roaming\Python\Python37\site-packages\sklearn\model_selection\_validation.py:515: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\ankur.kumar\AppData\Roaming\Python\Python37\site-packages\sklearn\model_selection\_validation.py:515: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\ankur.kumar\AppData\Roaming\Python\Python37\site-packages\sklearn\model_selection\_validation.py:515: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\ankur.kumar\AppData\Roaming\Python\Python37\site-packages\sklearn\model_selection\_validation.py:515: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\ankur.kumar\AppData\Roaming\Python\Python37\site-packages\sklearn\model_selection\_validation.py:515: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)

mean acc: 0.5768496466596873
std dev: 0.0069581505053437015

# making original data ready for prediction

In [496]:
def test_ready(train):
    train_new=train.drop(['user_dob','user_id'], axis=1)
    train_new['delivery_time']= train_new['delivery_date']-train_new['order_date']
    train_new['delivery_time']=train_new['delivery_time'].apply(lambda x: x.days)
    train_new['delivery_time'].fillna((train_new['delivery_time'].median()), inplace=True)
    
    train_new['cust_att_time']= train_new['user_reg_date']-train_new['order_date']
    train_new['cust_att_time']=train_new['cust_att_time'].apply(lambda x: x.days)
    train_new['cust_att_time'].fillna((train_new['cust_att_time'].median()), inplace=True)
    
    df_tr=train_new.drop(['order_item_id','item_id'], axis=1)
    df_tr=df_tr.drop(['item_size'], axis=1)
    
    df_train=df_tr.drop(['order_date','delivery_date','user_reg_date'], axis=1)
    df_train=MultiColumnLabelEncoder(columns = ['item_color','brand_id','user_title','user_state']).fit_transform(df_train)
    
    df_train=df_train[['item_color','brand_id','item_price','user_title','user_state','delivery_time','cust_att_time']]
    
    return df_train

In [498]:
test_feat=test_ready(test)

In [499]:
test_feat.head()

,item_color,brand_id,item_price,user_title,user_state,delivery_time,cust_att_time
0,72,41,69.90,3,9,3.0,-91
1,45,1,19.90,3,9,9.0,-91
2,73,38,39.95,3,0,3.0,-492
3,73,4,69.90,3,7,3.0,-154
4,66,0,89.90,3,0,3.0,-492

In [500]:
test_fe=test_feat.iloc[:,0:7].values

In [501]:
test_fe

array([[  72.  ,   41.  ,   69.9 , ...,    9.  ,    3.  ,  -91.  ],
       [  45.  ,    1.  ,   19.9 , ...,    9.  ,    9.  ,  -91.  ],
       [  73.  ,   38.  ,   39.95, ...,    0.  ,    3.  , -492.  ],
       ...,
       [  17.  ,   69.  ,  249.9 , ...,    6.  ,    3.  ,    1.  ],
       [  16.  ,  107.  ,  129.9 , ...,    7.  ,    1.  , -235.  ],
       [  19.  ,   33.  ,   29.9 , ...,   10.  ,    1.  , -572.  ]])

In [505]:
result= classifier.predict(test_fe)

In [506]:
result

array([0, 1, 0, ..., 0, 0, 0], dtype=int64)

In [516]:
res_list=list(result)

In [517]:
test_df=test.copy()

In [518]:
test_df['return']=res_list

In [514]:
len(res_df),len(test)

(20055, 20055)

In [519]:
test_df.head()

,order_item_id,order_date,delivery_date,item_id,item_size,item_color,brand_id,item_price,user_id,user_title,user_dob,user_state,user_reg_date,return
0,26,2016-06-23,2016-06-26,92,xl,turquoise,42,69.90,9392,Mrs,1962-04-14,1010,2016-03-24,0
1,28,2016-06-23,2016-07-02,2,xxl,green,2,19.90,9392,Mrs,1962-04-14,1010,2016-03-24,1
2,37,2016-06-23,2016-06-26,895,38,white,39,39.95,30826,Mrs,1964-04-27,1001,2015-02-17,0
3,56,2016-06-23,NaT,5,l,white,5,69.90,30828,Mrs,1966-05-13,1008,2016-01-21,0
4,65,2016-06-23,NaT,55,40,purple,1,89.90,22948,Mrs,1957-03-11,1001,2015-02-17,1

In [520]:
test_df.to_excel('test_with_return.xlsx')